// Задача 19 
// Напишите программу, которая принимает на вход число и проверяет, является ли оно палиндромом.

/*
int function(int num)
{
    int n = 0;

    while (num != 0)
    {
        n = n * 10 + num % 10;
        num = num / 10;
    }
    return n;
}

bool polin(int num1, int num2)
{
    if (num1 == num2)
    {
        Console.WriteLine("число ясвляется полиндромом!");
        return true;
    }
    else
    {
        Console.WriteLine("число НЕ ясвляется полиндромом!");
        return false;
    }
}



Console.WriteLine("введите число: ");

int Num = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("отраженное число: ");

int result = function(Num);

Console.WriteLine(result);

Console.WriteLine(polin(Num, result));
*/






